app/views/top_commenters/show.html.haml

            %td= user.email
            %td= user.comments.count
---
SELECT COUNT({:sort=>"comments"}) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]