app/controllers/comments_controller.rb

  def create
    @comment = @movie.comments.create(params[:comment].permit(:content))
    @comment.user_id = current_user.id
    @comment.save
---
INSERT INTO "comments" ("content", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "qwe"], ["movie_id", 1], ["user_id", 21], ["created_at", "2017-11-05 19:44:57.158708"], ["updated_at", "2017-11-05 19:44:57.158708"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 21], ["updated_at", "2017-11-05 18:14:33.443987"], ["id", 1]]

  def update
    if @comment.update(params[:comment].permit(:content))
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "qweqwe"], ["updated_at", "2017-11-05 21:22:08.367553"], ["id", 12]]

  def find_post
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def find_comment
    @comment = @movie.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."movie_id" = ? AND "comments"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 12], ["LIMIT", 1]]