app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    @comments = Comment.where(movie_id: @movie).order("created_at DESC")
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = 1 ORDER BY created_at DESC