app/controllers/top_commenters_controller.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" IN (SELECT "users"."id" FROM "users" ORDER BY "users"."comments" ASC)
---
  def show
    @users = User.all.sort{|a,b| b.comments.count <=> a.comments.count}